app/views/sessions/showprofile.html.erb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
Imię:
<%= @person = Employee.find_by(id: session[:user_id])