app/views/orders/show.html.erb

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Oczekiwana data dostawy:</strong><%= @order&.delivery_date %></br>
  <strong>Dostawca:</strong><%= @courier = Courier.find_by(id: @order&.couriers_id)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  <strong>Komentarze:</strong><%= @order&.comment %></br>
  <strong>Pracownik przypisany:</strong><%= @employee = Employee.find_by(id: @order&.employees_id)