app/controllers/couriers_controller.rb

  def create
    @courier = Courier.new(courier_params)

    respond_to do |format|
      if @courier.save
---
INSERT INTO "couriers" ("name", "created_at", "updated_at", "surname", "password", "login", "company") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Jan"], ["created_at", "2020-12-05 08:49:54.092954"], ["updated_at", "2020-12-05 08:49:54.092954"], ["surname", "Kowalski"], ["password", "j"], ["login", "j"], ["company", "DHL"]]

    def set_courier
      @courier = Courier.find(params[:id])
---
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]