app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "created_at", "updated_at", "surname", "password", "login") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "a"], ["created_at", "2020-12-04 15:08:51.825119"], ["updated_at", "2020-12-04 15:08:51.825119"], ["surname", "a"], ["password", "a"], ["login", "a"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save