app/controllers/orders_controller.rb

  def show
    if session[:user_type] == "W"
      @type = "WOLONTARIUSZ"
    else if session[:user_type] == "D"
           @type = "DOSTAWCA"
         else if session[:user_type] == "PB"
                @type = "PRACOWNIK BIURA"
              end
         end
    end
    @prod = []
    items = ProductToOrder.where(orders_id: @order&.id)
    @number = items.length()
    items.each do |i|
      p = Product.find_by(id: i.products_id)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "product_to_orders".* FROM "product_to_orders" WHERE "product_to_orders"."orders_id" = $1  [["orders_id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]