app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "couriers".* FROM "couriers"
---
  def create_order

    @products = Product.all
    @couriers = Courier.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("value", "created_at", "updated_at", "status", "comment", "employees_id", "couriers_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["value", 2.34], ["created_at", "2020-12-05 10:50:12.548819"], ["updated_at", "2020-12-05 10:50:12.548819"], ["status", "created"], ["comment", " fghfh"], ["employees_id", 5], ["couriers_id", 1]]
INSERT INTO "products" ("name", "created_at", "updated_at", "producent", "price", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "we"], ["created_at", "2020-12-05 08:05:00.563478"], ["updated_at", "2020-12-05 08:05:00.563478"], ["producent", "ewe"], ["price", 5.78], ["description", "wewe"]]
INSERT INTO "product_to_orders" ("created_at", "updated_at", "quantity", "orders_id", "products_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-12-05 10:38:37.686828"], ["updated_at", "2020-12-05 10:38:37.686828"], ["quantity", 2], ["orders_id", 4], ["products_id", 1]]
INSERT INTO "orders" ("value", "created_at", "updated_at", "status", "comment", "couriers_id", "volonteers_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["value", 2.34], ["created_at", "2020-12-05 10:44:32.247073"], ["updated_at", "2020-12-05 10:44:32.247073"], ["status", "created"], ["comment", " "], ["couriers_id", 1], ["volonteers_id", 2]]
INSERT INTO "product_to_orders" ("created_at", "updated_at", "quantity", "orders_id", "products_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-12-05 10:44:32.270127"], ["updated_at", "2020-12-05 10:44:32.270127"], ["quantity", 1], ["orders_id", 8], ["products_id", 1]]
INSERT INTO "orders" ("value", "created_at", "updated_at", "status", "comment", "employees_id", "couriers_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["value", 2.34], ["created_at", "2020-12-05 10:51:31.349072"], ["updated_at", "2020-12-05 10:51:31.349072"], ["status", "created"], ["comment", " fghfh"], ["employees_id", 5], ["couriers_id", 1]]
INSERT INTO "orders" ("value", "created_at", "updated_at", "status", "comment", "employees_id", "couriers_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "product_to_orders" ("created_at", "updated_at", "quantity", "orders_id", "products_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-12-05 10:51:31.370370"], ["updated_at", "2020-12-05 10:51:31.370370"], ["quantity", 3], ["orders_id", 11], ["products_id", 1]]
---
   def create_order_check
    @quantity_list=params[:quantities]
    produkty=[]
    price_list = []
    value=0
    @products_id = params[:product_ids]
    @products_id.each do |id|
        @product = Product.find_by(id: id)
        value+=@product.price
    end
    @quantity_list=@quantity_list.reject(&:empty?)
    if session[:user_type] == "W"
        @order = Order.create(value: value, status: 'created', comment: params[:komentarz], couriers_id: params[:dostawca], volonteers_id: session[:user_id])
        index=0
        @products_id.each do |id|
            @prod_do_zam = ProductToOrder.create(quantity:@quantity_list[index], orders_id: @order.id, products_id: id)
            index=index+1
        end
        return render action: :order_complited
    end
    if session[:user_type] == "PB"
        @order = Order.create(value: value , status: 'created', comment: params[:komentarz], couriers_id: params[:dostawca], employees_id: session[:user_id])
        index=0
        @products_id.each do |id|
            @prod_do_zam = ProductToOrder.create(quantity:@quantity_list[index], orders_id: @order.id, products_id: id)

INSERT INTO "products" ("name", "created_at", "updated_at", "producent", "price", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "d"], ["created_at", "2020-12-05 07:45:16.793023"], ["updated_at", "2020-12-05 07:45:16.793023"], ["producent", "d"], ["price", 2.34], ["description", "d"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save