app/controllers/sessions_controller.rb

  def create_user_confirm
    user_type = params[:typ_uzytkownika]
    if params[:password]!=params[:confirm_password]
           return redirect_to '/create_user'
    end
    if user_type == "PB"
        @employee = Employee.create(login: params[:login],password: params[:password], name: params[:name], surname: params[:surname],
        email: params[:email], phone: params[:phone], adress: params[:adress])
        return redirect_to '/login'

    elsif user_type == "W"
        @volonteer = Volonteer.create(login: params[:login],password: params[:password], name: params[:name], surname: params[:surname],
        email: params[:email], phone: params[:phone], adress: params[:adress])
---
INSERT INTO "employees" ("name", "created_at", "updated_at", "surname", "adress", "email", "password", "login") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "volonteers" ("name", "created_at", "updated_at", "surname", "adress", "email", "password", "login") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"