app/controllers/sessions_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."login" = $1 LIMIT $2  [["login", ""], ["LIMIT", 1]]
SELECT  "volonteers".* FROM "volonteers" WHERE "volonteers"."login" = $1 LIMIT $2  [["login", "a"], ["LIMIT", 1]]
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."login" = $1 LIMIT $2  [["login", "darek"], ["LIMIT", 1]]
---
  def create
    user_type = params[:typ_uzytkownika]
    if user_type == "PB"
        @employee = Employee.find_by(login: params[:username])
        if @employee && @employee.password==params[:password]
            session[:user_id] = @employee.id
            session[:user_type] = user_type
            return redirect_to '/welcome'
        end

    elsif user_type == "W"
        @volonteer = Volonteer.find_by(login: params[:username])
        if @volonteer && @volonteer.password==params[:password]
            session[:user_id] = @volonteer.id
            session[:user_type] = user_type
            return redirect_to '/welcome'
        end

    elsif user_type == "D"
        @courier = Courier.find_by(login: params[:username])

INSERT INTO "employees" ("name", "created_at", "updated_at", "surname", "adress", "email", "password", "login") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "volonteers" ("name", "created_at", "updated_at", "surname", "adress", "email", "password", "login") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "couriers" ("name", "created_at", "updated_at", "surname", "adress", "email", "password", "login") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create_user_confirm
    user_type = params[:typ_uzytkownika]
    if params[:password]!=params[:confirm_password]
           return redirect_to '/create_user'
    end
    if user_type == "PB"
        @employee = Employee.create(login: params[:login],password: params[:password], name: params[:name], surname: params[:surname],
        email: params[:email], phone: params[:phone], adress: params[:adress])
        return redirect_to '/login'

    elsif user_type == "W"
        @volonteer = Volonteer.create(login: params[:login],password: params[:password], name: params[:name], surname: params[:surname],
        email: params[:email], phone: params[:phone], adress: params[:adress])
        return redirect_to '/login'

    elsif user_type == "D"
        @courier = Courier.create(login: params[:login],password: params[:password], name: params[:name], surname: params[:surname],
        email: params[:email], phone: params[:phone], adress: params[:adress])