app/controllers/volonteers_controller.rb

  def index
    @volonteers = Volonteer.all
---
SELECT "volonteers".* FROM "volonteers"

  def create
    @volonteer = Volonteer.new(volonteer_params)

    respond_to do |format|
      if @volonteer.save
---
INSERT INTO "volonteers" ("created_at", "updated_at", "password") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-12-04 14:27:53.742905"], ["updated_at", "2020-12-04 14:27:53.742905"], ["password", "a"]]

    def set_volonteer
      @volonteer = Volonteer.find(params[:id])
---
SELECT  "volonteers".* FROM "volonteers" WHERE "volonteers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]